from Class_Cart import Cart  # Імпортуємо клас Cart

# Створюємо об'єкт класу
cart = Cart("Олександр")

# Додаємо товари
cart.add_item("Ноутбук")
cart.add_item("Смартфон")

# Виводимо інформацію про кошик
print(cart.show_cart())  # Кошик клієнта: Олександр, товари: Ноутбук, Смартфон

# Видаляємо товар і виводимо повідомлення
message = cart.remove_item("Ноутбук")
print(message)  # Усі товари 'Ноутбук' видалено з кошика.

# Показуємо оновлений кошик
print(cart.show_cart())  # Кошик клієнта: Олександр, товари: Смартфон
